// Задача 6: Напишите программу,
// которая на вход принимает число и выдаёт,
// является ли число чётным (делится ли оно на два без остатка).

Console.Write("Введите число: ");
int numN = Convert.ToInt32(Console.ReadLine());
if (numN % 2 == 0)
{
Console.WriteLine("Чётное число");
}

  else
  {
Console.WriteLine("Нечётное число");
  }
  

    