// Задача 4: Напишите программу,
// которая принимает на вход три числа и выдаёт максимальное из этих чисел.

Console.Write("Введите первое число: ");
int nam1 = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите второе число: ");
int nam2 = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите третье число: ");
int nam3 = Convert.ToInt32(Console.ReadLine());
 if (num1 > num2)
 {
  if (num1 > num3)
  {
Console.WriteLine("Первое число больше");
  }
 else
 {
Console.WriteLine("Третье число больше");
 }
 }
 if (num2 > num3)
 {
Console.WriteLine("Второе число больше");
 }
 else {
    Console.WriteLine("Третье число больше");
 }
 


  


